commands_templates/SetPreset0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver20/ptz/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetPreset>
         <!--type: ReferenceToken-->
         <wsdl:ProfileToken>?</wsdl:ProfileToken>
         <!--Optional:-->
         <!--type: string-->
         <wsdl:PresetName>?</wsdl:PresetName>
         <!--Optional:-->
         <!--type: ReferenceToken-->
         <wsdl:PresetToken>?</wsdl:PresetToken>
      </wsdl:SetPreset>
   </soap:Body>
</soap:Envelope>